{
  "en": {
    "navHome": "Home",
    "navRooms": "Rooms",
    "navMedia": "Media Center",
    "navOffers": "Offers",
    "navContact": "Contact Us",
    "heroTitle": "Stay with us in comfort",
    "heroSubtitle": "In The Heart Of Muscat",
    "heroButton": "Book Now",
    "aboutTitle": "About Us",
    "aboutText1": "<strong>Horizon Hotel Apartments</strong> is a distinguished <strong>3-star</strong>, offering a <strong>luxurious experience</strong> in perfect harmony with standards of comfort and modern amenities. Nestled in the vibrant Al Khoud, directly Near Sultan Qaboos Mosque. The hotel features contemporary décor with thoughtful touches designed to enhance your stay. Each room is meticulously crafted to provide a serene and stylish retreat, complete with high-quality furnishings and modern conveniences.",
    "aboutText2": "At Horizon Hotel Apartments, you'll find a team of dedicated professionals committed to delivering exceptional service and ensuring your stay is both <strong>comfortable and memorable</strong>. From the moment you arrive, our staff will be attentive to your needs, offering personalized recommendations and assistance to make your visit to Muscat truly special. Come and experience the perfect blend of luxury and convenience at Horizon Hotel Apartments, where every detail is designed with your comfort in mind.",
    "featuresTitle": "About Horizon Hotel Apartments",
    "feature1Title": "Hospitality",
    "feature1Text": "Where comfort meets elegance in a warm atmosphere that reflects Arab hospitality. We offer you a unique accommodation experience that combines superior service, an ideal location, and comprehensive amenities to ensure an unforgettable stay.",
    "feature2Title": "Facilities",
    "feature2Text": "Our hotel is not just a place to stay, but a complete hospitality experience. Enjoy a selection of carefully designed rooms to suit different tastes and needs, with facilities that suit you.",
    "feature3Title": "24-hour service",
    "feature3Text": "We strive to serve you throughout your stay with us. Therefore, we provide <strong>24-hour service</strong>.",
    "contactTitle": "Drop us a line",
    "contactText1": "We are pleased to have you visit us.",
    "contactText2": "<strong>Location:</strong> Al Khoud, Muscat - Sultanate of Oman",
    "contactText3": "<strong>WhatsApp:</strong> +968 97333972",
    "contactText4": "<strong>Tel:</strong> 24533273",
    "contactText5": "<strong>Email:</strong> info@hha-om.com",
    "contactText6": "<strong>Plus Code:</strong> J5FX+55 السيب‎، Oman",
    "contactButton": "Drop us a line!",
    "contactFormName": "Name",
    "contactFormEmail": "Email*",
    "contactFormMessage": "Message",
    "contactFormSend": "Send",
    "contactFormCancel": "Cancel",
    "bookingTitle": "BOOK NOW",
    "bookingText": "Book your room now and enjoy a safe and comfortable stay.",
    "bookingName": "Name",
    "bookingEmail": "Email",
    "bookingPhone": "Phone Number",
    "bookingCheckIn": "Check-in",
    "bookingCheckOut": "Check-out",
    "bookingButton": "BOOK NOW",
    "bookingRecaptcha": "This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
    "bookingWhatsapp": "Message us on WhatsApp",
    "mediaHeroText": "OUR PARTICIPATION IN THE MEETING OF THE MINISTRY OF HERITAGE",
    "mediaSitesTitle": "TOP SITES NEAR OUR HOTEL",
    "site1Title": "MUSCAT INTERNATIONAL AIRPORT",
    "site1Text": "Muscat International Airport is the Sultanate of Oman's primary gateway and one of the most modern airports in the region. It combines modern designs and integrated services to provide a comfortable and safe travel experience for passengers. The airport features a new terminal, which opened in 2018 and can accommodate up to 20 million passengers annually. It boasts state-of-the-art facilities, including luxurious lounges, a diverse duty-free market, international restaurants and cafés, a transit hotel, and integrated transportation services connecting the airport to Muscat and surrounding areas. It is also a major hub for Oman Air and SalamAir, receiving direct flights from various Gulf countries, Asia, and Europe, making it Oman's gateway to the world.",
    "site2Title": "THE OMAN CONVENTION AND EXHIBITION CENTRE",
    "site2Text": "The Oman Convention and Exhibition Centre in Muscat is one of the region's leading destinations for hosting international events, exhibitions, and conferences. Featuring a modern architectural design and a strategic location near Muscat International Airport, it is an ideal attraction for visitors from within and outside the Sultanate. The centre features multi-purpose halls, a theatre that can accommodate thousands of attendees, exhibition halls equipped with the latest audio-visual technology, and spaces dedicated to meetings and trade shows. It is complimented by a group of surrounding hotels and entertainment facilities, offering a comprehensive experience that combines business, creativity, and authentic Omani hospitality.",
    "site3Title": "MUTTRAH SOUQ",
    "site3Text": "Muttrah Souq in Muscat Governorate is one of the oldest and most famous traditional markets in the Sultanate of Oman and a prominent tourist destination that reflects the fragrance of history and the spirit of Omani authenticity. The market is characterized by its narrow alley lanes filled with small shops displaying a wide range of goods, such as incense and frankincense, silver and handicrafts, textiles, spices, and souvenirs. The market is a favorite stop for tourists and visitors seeking a shopping experience that combines authenticity and the oriental spirit, where the scent of perfumes and incense mingle with the warm atmosphere of Omani hospitality. Muttrah Souq remains a symbol of history and ancient trade in the heart of Muscat.",
    "site4Title": "THE SULTAN QABOOS GRAND MOSQUE",
    "site4Text": "The Sultan Qaboos Grand Mosque in Muscat is one of the most important religious and architectural landmarks in the Sultanate of Oman, a symbol of luxury and artistic creativity. Opened in 2001 by order of the late Sultan Qaboos bin Said, it features an Islamic design blended with authentic Omani touches, including one of the largest chandeliers and carpets in the world. The mosque can accommodate tens of thousands of worshippers and includes a main prayer hall, a rich library, and an Islamic art gallery. Open to visitors of all nationalities, it serves as a center for spirituality, culture, and cultural exchange, as well as an architectural icon that adorns the heart of the capital, Muscat.",
    "site5Title": "THE ROYAL OPERA HOUSE MUSCAT",
    "site5Text": "The Royal Opera House Muscat is a prominent architectural and cultural masterpiece in the Sultanate of Oman, a center for fine arts and world music. Opened in 2011 by order of the late Sultan Qaboos bin Said, it reflects the Sultanate's interest in arts, culture, and openness to civilizations. Featuring a unique design that combines traditional Omani architecture with modern touches, the building hosts sophisticated musical, operatic, and theatrical performances, featuring renowned international bands and artists. It also features exhibition spaces, fine dining, and modern facilities, making it a distinctive cultural and tourist destination that adds a touch of creativity and beauty to the heart of the capital, Muscat.",
    "site6Title": "THE NATIONAL MUSEUM",
    "site6Text": "The National Museum in Muscat is the most prominent cultural edifice that tells the story of Oman throughout the ages. Opened in 2016, it serves as a platform for preserving and displaying Omani heritage in a modern, sophisticated style. The museum houses more than 5,000 rare artifacts and historical pieces, distributed among specialized halls such as the Maritime History Hall, the Weapons Hall, the Currency Hall, and the Traditional Arts Hall. A children's hall is also dedicated to simplifying history for younger generations. The museum features modern display technologies such as interactive screens and multimedia, providing visitors with an engaging learning experience that combines authenticity and technology. With its prime location near Al Alam Palace and the Government District, the National Museum has become an essential destination for anyone wishing to discover Oman's rich history and culture.",
    "discoverTitle": "DISCOVER OMAN AND WONDERFUL PLACES",
    "discoverButton": "LEARN MORE",
    "offersTitle": "OFFERS",
    "offersSubtitle": "Our Special Offer",
    "offersText": "Book two nights and enjoy the third night absolutely free. Experience luxury and comfort with us at Horizon Hotel Apartments.",
    "doubleRoomTitle": "DOUBLE ROOM",
    "doubleRoomDesc": "- Includes a double bed and a bathroom",
    "doubleRoomPrice": "15 riyals",
    "twinRoomTitle": "TWIN ROOM",
    "twinRoomDesc": "- Contains two single beds and a bathroom",
    "twinRoomPrice": "15 riyals",
    "doubleApartmentTitle": "DOUBLE-BEDROOM APARTMENT",
    "doubleApartmentDesc": "- Contains a separate room with a double bed, a bathroom, a living room, and a fully equipped kitchen.",
    "doubleApartmentPrice": "20 riyals",
    "twoBedroomTitle": "TWO BEDROOM APARTMENT",
    "twoBedroomDesc": "- Ideal for a family, it includes two bedrooms, two bathrooms, a living room, and a fully equipped kitchen.",
    "twoBedroomPrice": "20 riyals",
    "suiteTitle": "SUITE",
    "suiteDesc": "- Fully updated with a modern design, it includes a bedroom, a private bathroom, a living room, a kitchen, and an additional bathroom.",
    "suitePrice": "35 riyals",
    "footerCopyright": "Copyright © 2025 Horizon Hotel Apartments - All Rights Reserved.",
    "successMessage": "Thank you for your inquiry! We will get back to you within 48 hours.",
    "contactLead": "Ready to book with us? Have a question about our rooms or services? We'll be happy to help!",
    "contactFindUs": "Find us on Google Maps",
    "contactHours": "Front Desk Hours: 24h / 7d",
    "bookingNamePlaceholder": "Your full name",
    "bookingEmailPlaceholder": "you@example.com",
    "bookingDates": "Your Travel Dates",
    "bookingDatesPlaceholder": "e.g., 12–16 Oct, 2025",
    "bookingNotes": "Tell us more about your desired accommodations",
    "bookingNotesPlaceholder": "Room type, number of guests, preferences…",
    "contactSubscribe": "Sign up for our email list for updates, promotions, and more.",
    "contactSubscribeAr": "سجل في قائمة البريد الإلكتروني للتحديثات والعروض والمزيد.",
    "hotelName": "Horizon Hotel Apartments",
"findOnMap": "Find us on Google Maps",
"phone1": "+968 24533273",
"phone2": "+968 97333972",
"email": "horizonhotel652@gmail.com",
"frontDeskHours": "Front Desk Hours: 24h / 7d"
  },
  "ar": {
    "navHome": "الرئيسية",
    "navRooms": "الغرف",
    "navMedia": "المركز الإعلامي",
    "navOffers": "العروض",
    "navContact": "اتصل بنا",
    "heroTitle": "أقم معنا في راحة",
    "heroSubtitle": "في قلب مسقط",
    "heroButton": "احجز الآن",
    "aboutTitle": "من نحن",
    "aboutText1": "الأفق للشقق الفندقية هي فنادق <strong>3 نجوم</strong> متميز، يقدم <strong>تجربة فاخرة</strong> بتناغم تام مع معايير الراحة والوسائل الحديثة. يقع في منطقة الخوض النابضة بالحياة، بالقرب من جامع السلطان قابوس. يتميز الفندق بديكور معاصر مع لمسات مدروسة مصممة لتعزيز إقامتك. تم تصميم كل غرفة بدقة لتوفر ملاذًا هادئًا وأنيقًا، مع أثاث عالي الجودة ووسائل راحة حديثة.",
    "aboutText2": "في الأفق للشقق الفندقية، ستجد فريقًا من المحترفين المتفانين الملتزمين بتقديم خدمة استثنائية وضمان أن تكون إقامتك <strong>مريحة ولا تنسى</strong>. من لحظة وصولك، سيكون طاقم العمل منتبهًا لاحتياجاتك، ويقدم توصيات ومساعدات مخصصة لجعل زيارتك لمسقط مميزة حقًا. تعال وجرب المزيج المثالي من الفخامة والراحة في الأفق للشقق الفندقية، حيث تم تصميم كل التفاصيل مع وضع راحتك في الاعتبار.",
    "featuresTitle": "عن الأفق للشقق الفندقية",
    "feature1Title": "الضيافة",
    "feature1Text": "حيث تلتقي الراحة بالأناقة في أجواء دافئة تعكس الضيافة العربية. نقدم لك تجربة إقامة فريدة تجمع بين خدمة فائقة وموقع مثالي ومرافق شاملة لضمان إقامة لا تنسى.",
    "feature2Title": "المرافق",
    "feature2Text": "فندقنا ليس مجرد مكان للإقامة، بل تجربة ضيافة كاملة. استمتع بمجموعة مختارة من الغرف المصممة بعناية لتناسب الأذواق والاحتياجات المختلفة، مع مرافق تناسبك.",
    "feature3Title": "خدمة على مدار 24 ساعة",
    "feature3Text": "نسعى لخدمتك طوال إقامتك معنا. لذلك، نقدم <strong>خدمة على مدار 24 ساعة</strong>.",
    "contactTitle": "اتصل بنا",
    "contactText1": "يسعدنا زيارتكم لنا.",
    "contactText2": "<strong>الموقع:</strong> الخوض، مسقط - سلطنة عمان",
    "contactText3": "<strong>واتساب:</strong> 97333972+968",
    "contactText4": "<strong>هاتف:</strong> 24533273",
    "contactText5": "<strong>البريد الإلكتروني:</strong> info@hha-om.com",
    "contactText6": "<strong>الرمز الجغرافي:</strong> J5FX+55 السيب‎، عمان",
    "contactButton": "اتصل بنا!",
    "contactFormName": "الاسم",
    "contactFormEmail": "البريد الإلكتروني*",
    "contactFormMessage": "الرسالة",
    "contactFormSend": "إرسال",
    "contactFormCancel": "إلغاء",
    "bookingTitle": "احجز الآن",
    "bookingText": "احجز غرفتك الآن واستمتع بإقامة آمنة ومريحة.",
    "bookingName": "الاسم",
    "bookingEmail": "البريد الإلكتروني",
    "bookingPhone": "رقم الهاتف",
    "bookingCheckIn": "تاريخ الوصول",
    "bookingCheckOut": "تاريخ المغادرة",
    "bookingButton": "احجز الآن",
    "bookingRecaptcha": "هذا الموقع محمي بواسطة reCAPTCHA وتنطبق عليه سياسة الخصوصية وشروط الخدمة من Google.",
    "bookingWhatsapp": "راسلنا على واتساب",
    "mediaHeroText": "مشاركتنا في اجتماع وزارة التراث",
    "mediaSitesTitle": "أهم المعالم بالقرب من فندقنا",
    "site1Title": "مطار مسقط الدولي",
    "site1Text": "مطار مسقط الدولي هو البوابة الرئيسية لسلطنة عمان وأحد أكثر المطارات حداثة في المنطقة. يجمع بين التصاميم الحديثة والخدمات المتكاملة لتوفير تجربة سفر مريحة وآمنة للركاب. يتميز المطار بمبنى جديد، افتتح في عام 2018، ويتسع لما يصل إلى 20 مليون مسافر سنويًا. ويضم مرافق حديثة تشمل صالات فاخرة، وسوق متنوعة معفاة من الرسوم الجمركية، ومطاعم ومقاهي دولية، وفندق عبور، وخدمات نقل متكاملة تربط المطار بمسقط والمناطق المحيطة. وهو أيضًا مركز رئيسي لطيران عمان وطيران السلام، ويستقبل رحلات مباشرة من مختلف دول الخليج وآسيا وأوروبا، مما يجعله بوابة عمان إلى العالم.",
    "site2Title": "مركز عمان للمؤتمرات والمعارض",
    "site2Text": "مركز عمان للمؤتمرات والمعارض في مسقط هو أحد الوجهات الرائدة في المنطقة لاستضافة الفعاليات الدولية والمعارض والمؤتمرات. يتميز بتصميم معماري حديث وموقع استراتيجي قريب من مطار مسقط الدولي، مما يجعله نقطة جذب مثالية للزوار من داخل السلطنة وخارجها. يضم المركز قاعات متعددة الأغراض، ومسرحًا يتسع لآلاف الحضور، وقاعات معارض مجهزة بأحدث التقنيات السمعية والبصرية، ومساحات مخصصة للاجتماعات والمعارض التجارية. ويكمل ذلك مجموعة من الفنادق والمرافق الترفيهية المحيطة، مما يقدم تجربة شاملة تجمع بين العمل والإبداع والضيافة العمانية الأصيلة.",
    "site3Title": "سوق مطرح",
    "site3Text": "سوق مطرح في محافظة مسقط هو أحد أقدم وأشهر الأسواق التقليدية في سلطنة عمان ووجهة سياحية بارزة تعبق برائحة التاريخ وروح الأصالة العمانية. يتميز السوق بأزقته الضيقة المليئة بالدكاكين الصغيرة التي تعرض مجموعة واسعة من البضائع، مثل البخور واللبان، والفضيات والحرف اليدوية، والأقمشة، والتوابل، والتحف. يعد السوق محطة مفضلة للسياح والزائرين الباحثين عن تجربة تسوق تجمع بين الأصالة والروح الشرقية، حيث تختلط روائح العطور والبخور بالأجواء الدافئة للضيافة العمانية. يبقى سوق مطرح رمزًا للتاريخ والتجارة القديمة في قلب مسقط.",
    "site4Title": "جامع السلطان قابوس الأكبر",
    "site4Text": "جامع السلطان قابوس الأكبر في مسقط هو أحد أهم المعالم الدينية والمعمارية في سلطنة عمان، ورمز للفخامة والإبداع الفني. افتتح في عام 2001 بأمر من السلطان الراحل قابوس بن سعيد، ويتميز بتصميم إسلامي ممزوج بلمسات عمانية أصيلة، بما في ذلك إحدى أكبر الثريات والسجاد في العالم. يتسع المسجد لعشرات الآلاف من المصلين ويشمل قاعة صلاة رئيسية، ومكتبة غنية، ومعرض للفن الإسلامي. مفتوح للزوار من جميع الجنسيات، ويخدم كمركز للروحانية والثقافة والتبادل الثقافي، بالإضافة إلى كونه أيقونة معمارية تزين قلب العاصمة مسقط.",
    "site5Title": "دار الأوبرا السلطانية",
    "site5Text": "دار الأوبرا السلطانية في مسقط هي تحفة معمارية وثقافية بارزة في سلطنة عمان، ومركز للفنون الجميلة والموسيقى العالمية. افتتحت في عام 2011 بأمر من السلطان الراحل قابوس بن سعيد، وتعكس اهتمام السلطنة بالفنون والثقافة والانفتاح على الحضارات. تتميز بتصميم فريد يجمع بين العمارة العمانية التقليدية واللمسات الحديثة، ويستضيف المبنى عروضًا موسيقية وأوبرالية ومسرحية راقية، بمشاركة فرق وفنانين عالميين مشهورين. كما يضم مساحات عرض، ومطاعم فاخرة، ومرافق حديثة، مما يجعله وجهة ثقافية وسياحية متميزة تضيف لمسة من الإبداع والجمال لقلب العاصمة مسقط.",
    "site6Title": "المتحف الوطني",
    "site6Text": "المتحف الوطني في مسقط هو الصرح الثقافي الأبرز الذي يحكي قصة عمان عبر العصور. افتتح في عام 2016، ويخدم كمنصة للحفاظ على التراث العماني وعرضه بأسلوب حديث ومتطور. يضم المتحف أكثر من 5000 قطعة أثرية وتاريخية نادرة، موزعة على قاعات متخصصة مثل قاعة التاريخ البحري، وقاعة الأسلحة، وقاعة العملة، وقاعة الفنون التقليدية. كما توجد قاعة مخصصة للأطفال لتبسيط التاريخ للأجيال الصغيرة. ويتميز المتحف بتقنيات عرض حديثة مثل الشاشات التفاعلية والوسائط المتعددة، مما يوفر للزوار تجربة تعليمية جذابة تجمع بين الأصالة والتكنولوجيا. بموقعه المتميز قرب قصر العلم والمنطقة الحكومية، أصبح المتحف الوطني وجهة أساسية لأي شخص يرغب في اكتشاف التاريخ والثقافة الغنية لعمان.",
    "discoverTitle": "اكتشف عمان والأماكن الرائعة",
    "discoverButton": "اعرف المزيد",
    "offersTitle": "العروض",
    "offersSubtitle": "عرضنا الخاص",
    "offersText": "احجز ليلتين واستمتع بالليلة الثالثة مجانًا. جرب الفخامة والراحة معنا في الأفق للشقق الفندقية.",
    "doubleRoomTitle": "غرفة مزدوجة",
    "doubleRoomDesc": "- تحتوي على سرير مزدوح وحمام",
    "doubleRoomPrice": "15 ريال",
    "twinRoomTitle": "غرفة توأمية",
    "twinRoomDesc": "- تحتوي على سريرين فرديين وحمام",
    "twinRoomPrice": "15 ريال",
    "doubleApartmentTitle": "شقة بغرفة نوم مزدوجة",
    "doubleApartmentDesc": "- تحتوي على غرفة منفصلة بسرير مزدوح، وحمام، وصالة، ومطبخ مجهز بالكامل.",
    "doubleApartmentPrice": "20 ريال",
    "twoBedroomTitle": "شقة بغرفتي نوم",
    "twoBedroomDesc": "- مثالية للعائلة، تحتوي على غرفتي نوم، وحمامين، وصالة، ومطبخ مجهز بالكامل.",
    "twoBedroomPrice": "20 ريال",
    "suiteTitle": "جناح",
    "suiteDesc": "- محدث بالكامل بتصميم حديث، يحتوي على غرفة نوم، وحمام خاص، وصالة، ومطبخ، وحمام إضافي.",
    "suitePrice": "35 ريال",
    "footerCopyright": "حقوق النشر © 2025 الأفق للشقق الفندقية - جميع الحقوق محفوظة.",
    "successMessage": "شكرًا لاستفسارك! سوف نعود إليك في غضون 48 ساعة.",
    "contactLead": "مستعد للحجز معنا؟ لديك سؤال عن غرفنا أو خدماتنا؟ سنكون سعداء لمساعدتك!",
    "contactFindUs": "ابحث عنا على خرائط جوجل",
    "contactHours": "ساعات الاستقبال: 24 ساعة / 7 أيام",
    "bookingNamePlaceholder": "اسمك الكامل",
    "bookingEmailPlaceholder": "you@example.com",
    "bookingDates": "مواعيد سفرك",
    "bookingDatesPlaceholder": "مثال: 12-16 أكتوبر 2025",
    "bookingNotes": "أخبرنا المزيد عن الإقامة التي تريدها",
    "bookingNotesPlaceholder": "نوع الغرفة، عدد الضيوف، التفضيلات...",
    "contactSubscribe": "اشترك في قائمة البريد الإلكتروني للحصول على التحديثات والعروض والمزيد.",
    "contactSubscribeAr": "سجل في قائمة البريد الإلكتروني للتحديثات والعروض والمزيد.",
    "hotelName": "أجنحة الأفق للشقق الفندقية",
"findOnMap": "ابحث عنا على خرائط جوجل",
"phone1": "٢٤٥٣٣٢٧٣ ٩٦٨+",
"phone2": "٩٧٣٣٣٩٧٢ ٩٦٨+",
"email": "horizonhotel652@gmail.com",
"frontDeskHours": "ساعات عمل الاستقبال: 24 ساعة / 7 أيام"
  }
}
